sedfoam-master/test-ci/1DWetAvalanche/constant/forceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      forceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * * * * * following are for presure * * * * * * * * * * * * * * * //
// tilt  angle = 23° gradPMEAN = rhob*g*sin(tilt_angle) for rhob=2.65
//gradPMEAN        gradPMEAN        [ 1 -2 -2 0 0 0 0 ] (10.157641781771405 0 0 ); // mean pressure
// tilt angle = 26°for rhob=2.65
//gradPMEAN        gradPMEAN        [ 1 -2 -2 0 0 0 0 ] (11.39611551750225 0 0 ); // mean pressure

// tilt angle = 26°for rhob=1.0
//gradPMEAN        gradPMEAN        [ 1 -2 -2 0 0 0 0 ] (4.3004209500008495 0 0 ); 

// tilt angle = 28°for rhob=1000
//gradPMEAN        gradPMEAN        [ 1 -2 -2 0 0 0 0 ] (4006.79 0 0 );
//gradPMEAN        gradPMEAN        [ 1 -2 -2 0 0 0 0 ] (4.605512455540616*1500*0.58 0 0 );
//gradPMEAN        gradPMEAN        [ 1 -2 -2 0 0 0 0 ] (0 0 0 );
gradPMEAN        gradPMEAN        [ 1 -2 -2 0 0 0 0 ] (0 -0 0 );

tilt             tilt [ 0 0 0 0 0 ] 1;

Cvm             Cvm [ 0 0 0 0 0 ] 0;                // Virtual/Added Mass coefficient

Cl              Cl [ 0 0 0 0 0 ] 0;                 // Lift force coefficient

Ct              Ct [ 0 0 0 0 0 ] 0;                 // Eddy diffusivity coefficient for phase a

debugInfo	 false; 

writeTau         true;
ClipUa           ClipUa [ 0 0 0 0 0 0 0 ] 1;
// * * * * * * * * * * * * end of definition of pressure * * * * * * * * * * * * * //
